export const majors = [
  "播音与主持艺术",
  "材料成型及控制工程",
  "材料科学与工程",
  "财务管理",
  "财政学",
  "测控技术与仪器",
  "城市规划",
  "传播学",
  "船舶与海洋工程",
  "道路桥梁与渡河工程",
  "德语",
  "电气工程及其自动化",
  "电子封装技术",
  "电子科学与技术",
  "电子信息工程",
  "对外汉语",
  "法学",
  "法医学",
  "翻译",
  "给排水科学与工程",
  "工程管理",
  "工程力学",
  "工程造价",
  "工商管理",
  "工业工程",
  "工业设计",
  "公共事业管理",
  "功能材料",
  "光电信息工程",
  "光电子材料与器件",
  "光信息科学与技术",
  "广播电视新闻学",
  "广告学",
  "国际经济与贸易",
  "国际商务",
  "国际商务",
  "汉语言文学",
  "核工程与核技术",
  "护理",
  "护理学",
  "化学工程与工艺",
  "环境工程",
  "会计学",
  "机械设计制造及其自动化",
  "集成电路设计与集成系统",
  "计算机科学与技术",
  "计算机应用技术",
  "建筑环境与设备工程",
  "建筑学",
  "交通工程",
  "交通运输",
  "金融工程",
  "金融学",
  "经济学",
  "景观学",
  "口腔医学",
  "临床医学",
  "轮机工程",
  "热能与动力工程",
  "日语",
  "软件工程",
  "商务英语",
  "社会工作",
  "社会学",
  "生命科学与技术基地班",
  "生物技术",
  "生物科学",
  "生物信息技术",
  "生物医学工程",
  "生物制药",
  "市场营销",
  "数控技术",
  "数学与应用数学",
  "数字媒体技术",
  "水利水电工程",
  "通信工程",
  "统计学",
  "土木工程",
  "物理学",
  "物联网工程",
  "物流管理",
  "新能源科学与工程",
  "新闻学",
  "信息安全",
  "信息管理与信息系统",
  "信息与计算科学",
  "药学",
  "药学",
  "医学检验",
  "医学影像学",
  "艺术设计",
  "应用化学",
  "应用物理学",
  "英语",
  "预防医学",
  "哲学",
  "政治学与行政学",
  "中西医临床医学",
  "中药学",
  "自动化",
];

export const mavonConfig = {
  bold: true, // 粗体
  italic: true, // 斜体
  header: true, // 标题
  underline: true, // 下划线
  strikethrough: true, // 中划线
  superscript: true, // 上角标
  subscript: true, // 下角标
  ol: true, // 有序列表
  ul: true, // 无序列表
  link: true, // 链接
  fullscreen: true, // 全屏编辑
  readmodel: true, // 沉浸式阅读
  help: true, // 帮助
  undo: true, // 上一步
  redo: true, // 下一步
  alignleft: true, // 左对齐
  aligncenter: true, // 居中
  alignright: true, // 右对齐
  subfield: true, // 单双栏模式
  preview: true, // 预览
};
